# Data cleaning & Data manipulation

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
# The numpy.random.randn() function creates an array of specified shape and fills it with random values as per standard normal distribution.
data1=np.random.randn(10,3)
data2=np.random.randn(7,3)  #<- it will create the array of given shape matrix with the random values

In [4]:
data1

array([[-0.56026409,  1.27128318,  0.98995379],
       [-0.44854832, -0.30615307,  1.21116647],
       [-0.12423814,  0.47610123,  0.70689164],
       [ 0.41903099,  0.19819109,  0.7893961 ],
       [-0.18322199, -1.65138207, -1.31454597],
       [-1.00540997,  0.87120111,  1.44865251],
       [ 1.41596477, -0.77393695, -0.78076566],
       [ 0.05361718,  0.32130124,  0.79852835],
       [-0.01897162,  0.17526644, -1.63123794],
       [-0.21898182,  0.09390823, -0.28318798]])

In [5]:
data2

array([[ 0.83989925, -0.30649825,  0.78803585],
       [-0.39922345,  0.45387088,  1.40215753],
       [-1.14305021, -2.11649495,  0.46060118],
       [-1.07360164, -0.94173984,  1.30090294],
       [ 0.08628915,  0.06109473, -0.9802052 ],
       [-0.44656454,  1.17635665, -1.10716194],
       [ 0.82893162, -1.09009756,  0.8071498 ]])

In [6]:
df1=pd.DataFrame(data1,columns=["Col1","Col2","Col3"])
df2=pd.DataFrame(data2,columns=["Col1","Col2","Col3"])

In [7]:
df1

       Col1      Col2      Col3
0 -0.560264  1.271283  0.989954
1 -0.448548 -0.306153  1.211166
2 -0.124238  0.476101  0.706892
3  0.419031  0.198191  0.789396
4 -0.183222 -1.651382 -1.314546
5 -1.005410  0.871201  1.448653
6  1.415965 -0.773937 -0.780766
7  0.053617  0.321301  0.798528
8 -0.018972  0.175266 -1.631238
9 -0.218982  0.093908 -0.283188

In [8]:
df2

       Col1      Col2      Col3
0  0.839899 -0.306498  0.788036
1 -0.399223  0.453871  1.402158
2 -1.143050 -2.116495  0.460601
3 -1.073602 -0.941740  1.300903
4  0.086289  0.061095 -0.980205
5 -0.446565  1.176357 -1.107162
6  0.828932 -1.090098  0.807150

In [14]:
df3=df1.append(df2,ignore_index=True)

In [15]:
df3

        Col1      Col2      Col3
0  -0.560264  1.271283  0.989954
1  -0.448548 -0.306153  1.211166
2  -0.124238  0.476101  0.706892
3   0.419031  0.198191  0.789396
4  -0.183222 -1.651382 -1.314546
5  -1.005410  0.871201  1.448653
6   1.415965 -0.773937 -0.780766
7   0.053617  0.321301  0.798528
8  -0.018972  0.175266 -1.631238
9  -0.218982  0.093908 -0.283188
10  0.839899 -0.306498  0.788036
11 -0.399223  0.453871  1.402158
12 -1.143050 -2.116495  0.460601
13 -1.073602 -0.941740  1.300903
14  0.086289  0.061095 -0.980205
15 -0.446565  1.176357 -1.107162
16  0.828932 -1.090098  0.807150

In [18]:
for i in df3:
    print(i)

Col1
Col2
Col3

In [16]:
for i in df3["Col3"]:
    print(i)

0.9899537898305119
1.211166471312162
0.7068916352467892
0.7893960964072294
-1.3145459656829737
1.4486525092669014
-0.7807656553157393
0.7985283478575084
-1.6312379365711307
-0.2831879775316719
0.7880358489363444
1.4021575291695487
0.4606011845223971
1.3009029425194167
-0.9802052007768589
-1.1071619427126964
0.8071498034783227

In [20]:
#OR 
for i in df3.Col3:
    print(i)

0.9899537898305119
1.211166471312162
0.7068916352467892
0.7893960964072294
-1.3145459656829737
1.4486525092669014
-0.7807656553157393
0.7985283478575084
-1.6312379365711307
-0.2831879775316719
0.7880358489363444
1.4021575291695487
0.4606011845223971
1.3009029425194167
-0.9802052007768589
-1.1071619427126964
0.8071498034783227

# iteritems   
It will convert the DataFrame into dictionary.
The column name into keys and the data into values
and it will print the values column by column. First it will takethe values of column1 and then it will take the values of columne2

In [23]:
for key,values in df3.iteritems():
    print(key)

Col1
Col2
Col3

In [21]:
#for columns
for key,value in df3.iteritems():
    print(key,value)

Col1 0     0.710888
1    -0.328806
2    -1.846169
3    -0.626361
4    -0.510165
5    -0.481509
6     0.858866
7    -0.214969
8     0.039997
9     1.235591
10    2.000624
11   -0.821978
12    0.166105
13   -1.039821
14   -1.510310
15   -1.109665
16   -0.990257
Name: Col1, dtype: float64
Col2 0     0.464342
1     1.000314
2    -1.013042
3     0.488084
4     1.579486
5     1.353039
6     0.215175
7     0.977767
8    -0.441051
9     0.163279
10    0.332342
11    0.846747
12   -1.531537
13   -0.290395
14    0.481265
15    0.313711
16    1.736707
Name: Col2, dtype: float64
Col3 0    -0.121852
1    -1.824880
2    -0.525336
3    -1.196827
4     1.815609
5     0.207638
6    -0.050412
7     0.620320
8    -0.761193
9     0.260510
10   -0.298518
11    0.023442
12    0.558691
13    1.221144
14    0.458812
15    0.171217
16   -0.248473
Name: Col3, dtype: float64

# iterrows
This will print the elements row by row

In [23]:
df3

        Col1      Col2      Col3
0   0.710888  0.464342 -0.121852
1  -0.328806  1.000314 -1.824880
2  -1.846169 -1.013042 -0.525336
3  -0.626361  0.488084 -1.196827
4  -0.510165  1.579486  1.815609
5  -0.481509  1.353039  0.207638
6   0.858866  0.215175 -0.050412
7  -0.214969  0.977767  0.620320
8   0.039997 -0.441051 -0.761193
9   1.235591  0.163279  0.260510
10  2.000624  0.332342 -0.298518
11 -0.821978  0.846747  0.023442
12  0.166105 -1.531537  0.558691
13 -1.039821 -0.290395  1.221144
14 -1.510310  0.481265  0.458812
15 -1.109665  0.313711  0.171217
16 -0.990257  1.736707 -0.248473

In [32]:
#for printing as per rows
for index,rows in df3.iterrows():
    print(index,rows)

0 Col1   -0.560264
Col2    1.271283
Col3    0.989954
Name: 0, dtype: float64
1 Col1   -0.448548
Col2   -0.306153
Col3    1.211166
Name: 1, dtype: float64
2 Col1   -0.124238
Col2    0.476101
Col3    0.706892
Name: 2, dtype: float64
3 Col1    0.419031
Col2    0.198191
Col3    0.789396
Name: 3, dtype: float64
4 Col1   -0.183222
Col2   -1.651382
Col3   -1.314546
Name: 4, dtype: float64
5 Col1   -1.005410
Col2    0.871201
Col3    1.448653
Name: 5, dtype: float64
6 Col1    1.415965
Col2   -0.773937
Col3   -0.780766
Name: 6, dtype: float64
7 Col1    0.053617
Col2    0.321301
Col3    0.798528
Name: 7, dtype: float64
8 Col1   -0.018972
Col2    0.175266
Col3   -1.631238
Name: 8, dtype: float64
9 Col1   -0.218982
Col2    0.093908
Col3   -0.283188
Name: 9, dtype: float64
10 Col1    0.839899
Col2   -0.306498
Col3    0.788036
Name: 10, dtype: float64
11 Col1   -0.399223
Col2    0.453871
Col3    1.402158
Name: 11, dtype: float64
12 Col1   -1.143050
Col2   -2.116495
Col3    0.460601
Name: 12, dtype: float64
13 Col1   -1.073602
Col2   -0.941740
Col3    1.300903
Name: 13, dtype: float64
14 Col1    0.086289
Col2    0.061095
Col3   -0.980205
Name: 14, dtype: float64
15 Col1   -0.446565
Col2    1.176357
Col3   -1.107162
Name: 15, dtype: float64
16 Col1    0.828932
Col2   -1.090098
Col3    0.807150
Name: 16, dtype: float64

# Sort - sort_index()

In [28]:
unsorted_df=pd.DataFrame(np.random.randn(10,3),index=[5,7,3,9,1,4,8,2,4,0],columns=["Col1","Col2","Col3"])

In [30]:
unsorted_df

       Col1      Col2      Col3
5 -0.806212  0.555897  0.666997
7 -0.545670  0.629230  0.634687
3 -0.928229  0.006153 -0.243867
9 -0.072745  3.162730  0.411977
1  0.610179 -1.214624 -0.298270
4  1.088966 -1.505250 -0.739583
8 -1.941404 -0.031457  0.321785
2 -0.205306  0.766976 -0.293787
4 -1.148104  0.599141  1.273319
0 -0.369266 -0.384153  1.433893

In [31]:
unsorted_df.loc[0]

Col1   -0.369266
Col2   -0.384153
Col3    1.433893
Name: 0, dtype: float64

In [27]:
unsorted_df.sort_index()  #<- it will sort the index with its own row values

       Col1      Col2      Col3
0  0.435873  1.248088 -0.342256
1  0.492165 -0.682894  0.244321
2  0.873741 -1.238436 -1.640348
3 -1.188751 -0.765384  0.213024
4  0.534608 -0.038164  1.148619
4 -0.550969 -0.634921  1.869324
5 -2.154146 -2.369057 -2.190608
7 -0.242005 -0.689785 -0.974856
8  0.344321 -0.793717  0.565502
9  1.202970 -0.778932  0.810111

In [29]:
unsorted_df.sort_index(ascending=False) #This will print the row in descending order

       Col1      Col2      Col3
9  1.202970 -0.778932  0.810111
8  0.344321 -0.793717  0.565502
7 -0.242005 -0.689785 -0.974856
5 -2.154146 -2.369057 -2.190608
4  0.534608 -0.038164  1.148619
4 -0.550969 -0.634921  1.869324
3 -1.188751 -0.765384  0.213024
2  0.873741 -1.238436 -1.640348
1  0.492165 -0.682894  0.244321
0  0.435873  1.248088 -0.342256

In [31]:
unsorted_df.sort_index(axis=1)  #This will sort the columns by its name in ascending order. Means first Col1, then Col2 and Col3 will come 
# and also it will not change the values by rows. The value in every rows will be same

       Col1      Col2      Col3
5 -2.154146 -2.369057 -2.190608
7 -0.242005 -0.689785 -0.974856
3 -1.188751 -0.765384  0.213024
9  1.202970 -0.778932  0.810111
1  0.492165 -0.682894  0.244321
4  0.534608 -0.038164  1.148619
8  0.344321 -0.793717  0.565502
2  0.873741 -1.238436 -1.640348
4 -0.550969 -0.634921  1.869324
0  0.435873  1.248088 -0.342256

In [34]:
unsorted_df.sort_index(axis=1,ascending=False)  #<- first it will print Col3,then Col2 and after that Col1 will be printed\
# It will print the columns in descending order

       Col3      Col2      Col1
5 -2.190608 -2.369057 -2.154146
7 -0.974856 -0.689785 -0.242005
3  0.213024 -0.765384 -1.188751
9  0.810111 -0.778932  1.202970
1  0.244321 -0.682894  0.492165
4  1.148619 -0.038164  0.534608
8  0.565502 -0.793717  0.344321
2 -1.640348 -1.238436  0.873741
4  1.869324 -0.634921 -0.550969
0 -0.342256  1.248088  0.435873

In [ ]:
sort_values()

In [42]:
df=pd.DataFrame({"Apples":[50,95,105,75],"Grapes":[110,45,99,0]})

In [43]:
df

   Apples  Grapes
0      50     110
1      95      45
2     105      99
3      75       0

In [45]:
df.sort_values(by=["Apples"])

   Apples  Grapes
0      50     110
3      75       0
1      95      45
2     105      99

In [44]:
df.sort_values(by=["Apples"]) # by means by which columns, you want to sort the value
# This will sort the Apples column and also as per that the Grapes column will be also changed, not sorted

   Apples  Grapes
0      50     110
3      75       0
1      95      45
2     105      99

In [46]:
df.sort_values(by=["Apples","Grapes"])   #<- It will sort tha data by the first column only, because it can't change the row of dataframe

   Apples  Grapes
0      50     110
3      75       0
1      95      45
2     105      99

In [ ]:
Pandas uses 3 sorting algorithm for sorting and by default Quicksort is used
1. Quicksort
2. Mergesort  - very stable sorting algorithm for big datas
3. Heapsort

In [46]:
This kind method is used for choose the algorithm of sorting
df.sort_values(by=["Apples","Grapes"],kind="mergesort")

   Apples  Grapes
0      50     110
3      75       0
1      95      45
2     105      99

In [ ]:
[6,5,7,2,8,4,9,0].sort()  -> Timsort
python use Timsort method for sorting the list

# Stats - Advanced

In [47]:
df3

        Col1      Col2      Col3
0   0.710888  0.464342 -0.121852
1  -0.328806  1.000314 -1.824880
2  -1.846169 -1.013042 -0.525336
3  -0.626361  0.488084 -1.196827
4  -0.510165  1.579486  1.815609
5  -0.481509  1.353039  0.207638
6   0.858866  0.215175 -0.050412
7  -0.214969  0.977767  0.620320
8   0.039997 -0.441051 -0.761193
9   1.235591  0.163279  0.260510
10  2.000624  0.332342 -0.298518
11 -0.821978  0.846747  0.023442
12  0.166105 -1.531537  0.558691
13 -1.039821 -0.290395  1.221144
14 -1.510310  0.481265  0.458812
15 -1.109665  0.313711  0.171217
16 -0.990257  1.736707 -0.248473

In [48]:
df3[0:7]

       Col1      Col2      Col3
0 -0.560264  1.271283  0.989954
1 -0.448548 -0.306153  1.211166
2 -0.124238  0.476101  0.706892
3  0.419031  0.198191  0.789396
4 -0.183222 -1.651382 -1.314546
5 -1.005410  0.871201  1.448653
6  1.415965 -0.773937 -0.780766

In [49]:
df4= df3[0:7]  #<- it will help to make DataFrame from index 0 to 6
# or you can use drop method

In [55]:
df4

       Col1      Col2      Col3
0  0.710888  0.464342 -0.121852
1 -0.328806  1.000314 -1.824880
2 -1.846169 -1.013042 -0.525336
3 -0.626361  0.488084 -1.196827
4 -0.510165  1.579486  1.815609
5 -0.481509  1.353039  0.207638
6  0.858866  0.215175 -0.050412

In [50]:
df4=df3.drop([7,8,9,10,11,12,13,14,15,16])

In [52]:
df4

        Col1      Col2      Col3
0  -0.560264  1.271283  0.989954
2  -0.124238  0.476101  0.706892
3   0.419031  0.198191  0.789396
4  -0.183222 -1.651382 -1.314546
5  -1.005410  0.871201  1.448653
6   1.415965 -0.773937 -0.780766
11 -0.399223  0.453871  1.402158

# Covariance -> cov()

In [54]:
df4.Col2   #<- This is not possible in series. But in DataFrame, it is possible

0     1.271283
2     0.476101
3     0.198191
4    -1.651382
5     0.871201
6    -0.773937
11    0.453871
Name: Col2, dtype: float64

In [55]:
df4["Col2"]

0     1.271283
2     0.476101
3     0.198191
4    -1.651382
5     0.871201
6    -0.773937
11    0.453871
Name: Col2, dtype: float64

In [57]:
df4.Col3

0     0.989954
2     0.706892
3     0.789396
4    -1.314546
5     1.448653
6    -0.780766
11    1.402158
Name: Col3, dtype: float64

In [56]:
df4["Col2"].cov(df4["Col3"])  #<- it will print the covariance between two column 
# we will learn about what is covariance in the upcoming lectures

1.0055975987982149

In [66]:
df4.Col2.cov(df4.Col3) #<- You can also use cov method like this

0.36569640108860685

In [67]:
df4.cov  #<- this will print the covariance of entire dataset

<bound method DataFrame.cov of        Col1      Col2      Col3
0  0.710888  0.464342 -0.121852
1 -0.328806  1.000314 -1.824880
2 -1.846169 -1.013042 -0.525336
3 -0.626361  0.488084 -1.196827
4 -0.510165  1.579486  1.815609
5 -0.481509  1.353039  0.207638
6  0.858866  0.215175 -0.050412>

# Correlation
The relation between two variables

In [ ]:
1 or >1 -> Strong or high correlation
0 or <0 -> bed correlation

In [61]:
df4

        Col1      Col2      Col3
0  -0.560264  1.271283  0.989954
2  -0.124238  0.476101  0.706892
3   0.419031  0.198191  0.789396
4  -0.183222 -1.651382 -1.314546
5  -1.005410  0.871201  1.448653
6   1.415965 -0.773937 -0.780766
11 -0.399223  0.453871  1.402158

In [62]:
df4["Col2"].corr(df4["Col3"])  #<- it will print the correlation between column2 and column3

0.9252834692250894

In [71]:
df4.corr

<bound method DataFrame.corr of        Col1      Col2      Col3
0  0.710888  0.464342 -0.121852
1 -0.328806  1.000314 -1.824880
2 -1.846169 -1.013042 -0.525336
3 -0.626361  0.488084 -1.196827
4 -0.510165  1.579486  1.815609
5 -0.481509  1.353039  0.207638
6  0.858866  0.215175 -0.050412>

# Data Cleaning

In [68]:
df=pd.DataFrame(np.random.randn(5,3),
               index=["A","C","E","B","D"],
               columns=["Col1","Col2","Col3"])

In [71]:
df

       Col1      Col2      Col3
A -1.216449 -0.074915 -1.755774
C  0.284556  1.167029 -0.785234
E -0.283898  1.172413 -0.292304
B  1.721905  0.912500 -0.534465
D  0.100855 -2.165115  0.251858

In [67]:
df=df.reindex(["A","B","C","D","E"])  #<- This will rearrange the index as per you want

In [73]:
df

       Col1      Col2      Col3
A -1.216449 -0.074915 -1.755774
B  1.721905  0.912500 -0.534465
C  0.284556  1.167029 -0.785234
D  0.100855 -2.165115  0.251858
E -0.283898  1.172413 -0.292304

In [86]:
df=pd.DataFrame(np.random.randn(5,3),
               index=["A","E","F","G","H"],
               columns=["Col1","Col2","Col3"])

In [87]:
df

       Col1      Col2      Col3
A  0.653927 -0.088211 -0.737081
E -1.396726  0.619634 -1.635182
F -1.743105 -0.055153  0.461088
G -1.879650 -0.450106 -0.096780
H -0.500005  0.349774 -0.438815

In [88]:
df=df.reindex(["A","B","C","D","E","F","G","H"])  #<- it will not give an error but it will print the index values NaN where it is not defined
# And it will print NaN where you don't have rows with that index

In [89]:
df

       Col1      Col2      Col3
A  0.653927 -0.088211 -0.737081
B       NaN       NaN       NaN
C       NaN       NaN       NaN
D       NaN       NaN       NaN
E -1.396726  0.619634 -1.635182
F -1.743105 -0.055153  0.461088
G -1.879650 -0.450106 -0.096780
H -0.500005  0.349774 -0.438815

# isnull()    or   isna()
It will print true where there is NaN and it will print false where there is no NaN

In [90]:
df

       Col1      Col2      Col3
A  0.653927 -0.088211 -0.737081
B       NaN       NaN       NaN
C       NaN       NaN       NaN
D       NaN       NaN       NaN
E -1.396726  0.619634 -1.635182
F -1.743105 -0.055153  0.461088
G -1.879650 -0.450106 -0.096780
H -0.500005  0.349774 -0.438815

In [91]:
df.isnull()  #<- this will give true where NaN values

    Col1   Col2   Col3
A  False  False  False
B   True   True   True
C   True   True   True
D   True   True   True
E  False  False  False
F  False  False  False
G  False  False  False
H  False  False  False

In [83]:
df.isna()   #<- it is as same as isnull

    Col1   Col2   Col3
A  False  False  False
B   True   True   True
C   True   True   True
D   True   True   True
E  False  False  False
F  False  False  False
G  False  False  False
H  False  False  False

In [97]:
df.items

<bound method DataFrame.items of        Col1      Col2      Col3
A  0.653927 -0.088211 -0.737081
B       NaN       NaN       NaN
C       NaN       NaN       NaN
D       NaN       NaN       NaN
E -1.396726  0.619634 -1.635182
F -1.743105 -0.055153  0.461088
G -1.879650 -0.450106 -0.096780
H -0.500005  0.349774 -0.438815>

# notnull()

In [98]:
df

       Col1      Col2      Col3
A  0.653927 -0.088211 -0.737081
B       NaN       NaN       NaN
C       NaN       NaN       NaN
D       NaN       NaN       NaN
E -1.396726  0.619634 -1.635182
F -1.743105 -0.055153  0.461088
G -1.879650 -0.450106 -0.096780
H -0.500005  0.349774 -0.438815

In [99]:
df.notnull()

    Col1   Col2   Col3
A   True   True   True
B  False  False  False
C  False  False  False
D  False  False  False
E   True   True   True
F   True   True   True
G   True   True   True
H   True   True   True

In [84]:
df.notnull()  #<- It will print True if the values will not NaN and it will print False if the values will be NaN

    Col1   Col2   Col3
A   True   True   True
B  False  False  False
C  False  False  False
D  False  False  False
E   True   True   True
F   True   True   True
G   True   True   True
H   True   True   True

In [101]:
df.notnull().sum()

Col1    5
Col2    5
Col3    5
dtype: int64

In [86]:
df.isnull().sum()  #<- It will return the total number of null values in every column

Col1    3
Col2    3
Col3    3
dtype: int64

In [102]:
df.isnull().sum().sum()  #<- it will return total number of null values in the dataset

9

In [106]:
df.isnull().sum(1).sum()

9

In [103]:
df.isnull().sum(1)   #<- it will return the total number of null values in every row

A    0
B    3
C    3
D    3
E    0
F    0
G    0
H    0
dtype: int64

In [93]:
df["Col1"].isnull()  #<- It will give the values of is null or not from Col1 column

A    False
B     True
C     True
D     True
E    False
F    False
G    False
H    False
Name: Col1, dtype: bool

In [108]:
df.loc["G"].isnull()   #<- it will give the values of is null or not null from the row "G"

Col1    False
Col2    False
Col3    False
Name: G, dtype: bool

In [109]:
df.notnull().sum()  #<- it will return the total number of not null values

Col1    5
Col2    5
Col3    5
dtype: int64

# count()

In [111]:
df.count()

Col1    5
Col2    5
Col3    5
dtype: int64

In [110]:
df.count()  #<- it will give the total number of not null values inside the column

Col1    5
Col2    5
Col3    5
dtype: int64

In [91]:
df.count(1)  #<- it will give the total number of not null values inside every row

A    3
B    0
C    0
D    0
E    3
F    3
G    3
H    3
dtype: int64

In [ ]:
df.count() will take only not null values into consideration

# Clean missing (NaN) values

In [113]:
df

       Col1      Col2      Col3
A  0.653927 -0.088211 -0.737081
B       NaN       NaN       NaN
C       NaN       NaN       NaN
D       NaN       NaN       NaN
E -1.396726  0.619634 -1.635182
F -1.743105 -0.055153  0.461088
G -1.879650 -0.450106 -0.096780
H -0.500005  0.349774 -0.438815

# fillna()   
It will fill all the NaN values

In [115]:
df.fillna(0)

       Col1      Col2      Col3
A  0.653927 -0.088211 -0.737081
B  0.000000  0.000000  0.000000
C  0.000000  0.000000  0.000000
D  0.000000  0.000000  0.000000
E -1.396726  0.619634 -1.635182
F -1.743105 -0.055153  0.461088
G -1.879650 -0.450106 -0.096780
H -0.500005  0.349774 -0.438815

In [116]:
df.fillna(0)  #<- It will fill all the NaN values with 0
# It is just temporary change

       Col1      Col2      Col3
A  0.653927 -0.088211 -0.737081
B  0.000000  0.000000  0.000000
C  0.000000  0.000000  0.000000
D  0.000000  0.000000  0.000000
E -1.396726  0.619634 -1.635182
F -1.743105 -0.055153  0.461088
G -1.879650 -0.450106 -0.096780
H -0.500005  0.349774 -0.438815

In [117]:
df.fillna(10)

        Col1       Col2       Col3
A   0.653927  -0.088211  -0.737081
B  10.000000  10.000000  10.000000
C  10.000000  10.000000  10.000000
D  10.000000  10.000000  10.000000
E  -1.396726   0.619634  -1.635182
F  -1.743105  -0.055153   0.461088
G  -1.879650  -0.450106  -0.096780
H  -0.500005   0.349774  -0.438815

In [119]:
df.fillna("Hii",inplace=True)   #<- you can also insert string using fillna method
#this inplace=Tru method will permanently add the value at NAN place

In [121]:
df

       Col1      Col2      Col3
A  0.653927 -0.088211 -0.737081
B       Hii       Hii       Hii
C       Hii       Hii       Hii
D       Hii       Hii       Hii
E -1.396726  0.619634 -1.635182
F -1.743105 -0.055153  0.461088
G  -1.87965 -0.450106  -0.09678
H -0.500005  0.349774 -0.438815

In [122]:
df=pd.DataFrame(np.random.randn(6,3),index=["A","B","E","F","G","H"],columns=["col1","col2","col3"])

In [123]:
df

       col1      col2      col3
A  1.281079  0.367448 -1.281153
B  0.846867 -0.405940 -1.168294
E -1.159418  0.444864  0.181723
F  0.544106 -0.838843 -0.558220
G  0.811257  0.756369 -0.108973
H  0.844488 -0.234484  0.987277

In [128]:
df=df.reindex(["A","B","C","D","E","F","G","H","I"])

In [129]:
df

       col1      col2      col3
A  1.281079  0.367448 -1.281153
B  0.846867 -0.405940 -1.168294
C       NaN       NaN       NaN
D       NaN       NaN       NaN
E -1.159418  0.444864  0.181723
F  0.544106 -0.838843 -0.558220
G  0.811257  0.756369 -0.108973
H  0.844488 -0.234484  0.987277
I       NaN       NaN       NaN

In [ ]:
#Forwward Method - pad/ffill
#Backword Method - bfill/backfill

In [130]:
df

       col1      col2      col3
A  1.281079  0.367448 -1.281153
B  0.846867 -0.405940 -1.168294
C       NaN       NaN       NaN
D       NaN       NaN       NaN
E -1.159418  0.444864  0.181723
F  0.544106 -0.838843 -0.558220
G  0.811257  0.756369 -0.108973
H  0.844488 -0.234484  0.987277
I       NaN       NaN       NaN

In [132]:
df.fillna(method="pad")  #<- It will give the same value as above line of NaN have
#or you can write df.fillna(method="ffill")

       col1      col2      col3
A  1.281079  0.367448 -1.281153
B  0.846867 -0.405940 -1.168294
C  0.846867 -0.405940 -1.168294
D  0.846867 -0.405940 -1.168294
E -1.159418  0.444864  0.181723
F  0.544106 -0.838843 -0.558220
G  0.811257  0.756369 -0.108973
H  0.844488 -0.234484  0.987277
I  0.844488 -0.234484  0.987277

In [135]:
df.fillna(method="bfill")  #<- it will take the values of below row of NaN values
#or you can write df.fillna(method="backfill")

       col1      col2      col3
A  1.281079  0.367448 -1.281153
B  0.846867 -0.405940 -1.168294
C -1.159418  0.444864  0.181723
D -1.159418  0.444864  0.181723
E -1.159418  0.444864  0.181723
F  0.544106 -0.838843 -0.558220
G  0.811257  0.756369 -0.108973
H  0.844488 -0.234484  0.987277
I       NaN       NaN       NaN

In [145]:
df.loc["C"][0] = 5

In [146]:
df

       col1      col2      col3
A  1.281079  0.367448 -1.281153
B  0.846867 -0.405940 -1.168294
C  5.000000       NaN       NaN
D       NaN       NaN       NaN
E -1.159418  0.444864  0.181723
F  0.544106 -0.838843 -0.558220
G  0.811257  0.756369 -0.108973
H  0.844488 -0.234484  0.987277
I       NaN       NaN       NaN

In [147]:
df.fillna(method="pad",axis=1)  #<- The previous value of column is NaN, so upcoming next column value in same row will be also NaN
# It will fill from row

       col1      col2      col3
A  1.281079  0.367448 -1.281153
B  0.846867 -0.405940 -1.168294
C  5.000000  5.000000  5.000000
D       NaN       NaN       NaN
E -1.159418  0.444864  0.181723
F  0.544106 -0.838843 -0.558220
G  0.811257  0.756369 -0.108973
H  0.844488 -0.234484  0.987277
I       NaN       NaN       NaN

In [149]:
df.fillna(method="bfill",axis=1)   #<- it will take the value from the next column and since the next column has also NaN value, then it will also remain NaN

       col1      col2      col3
A  1.281079  0.367448 -1.281153
B  0.846867 -0.405940 -1.168294
C  5.000000       NaN       NaN
D       NaN       NaN       NaN
E -1.159418  0.444864  0.181723
F  0.544106 -0.838843 -0.558220
G  0.811257  0.756369 -0.108973
H  0.844488 -0.234484  0.987277
I       NaN       NaN       NaN

# dropna()
It will drop all that row which contain the NaN value
Most offly Never try to drop any data bcoz it will reduce the efficiency of our data analyzing

In [ ]:
the more will be data, the more will be accuracy and efficiency

In [150]:
df

       col1      col2      col3
A  1.281079  0.367448 -1.281153
B  0.846867 -0.405940 -1.168294
C  5.000000       NaN       NaN
D       NaN       NaN       NaN
E -1.159418  0.444864  0.181723
F  0.544106 -0.838843 -0.558220
G  0.811257  0.756369 -0.108973
H  0.844488 -0.234484  0.987277
I       NaN       NaN       NaN

In [151]:
df.dropna()  #<- It will drop all the NaN value contain rows

       col1      col2      col3
A  1.281079  0.367448 -1.281153
B  0.846867 -0.405940 -1.168294
E -1.159418  0.444864  0.181723
F  0.544106 -0.838843 -0.558220
G  0.811257  0.756369 -0.108973
H  0.844488 -0.234484  0.987277

In [152]:
df.dropna(1)  #<- here, this 1 will be delete all the NaN value contains columns. so, that's why it will be empty

Empty DataFrame
Columns: []
Index: [A, B, C, D, E, F, G, H, I]

# Replacing values

In [155]:
df=pd.DataFrame({"Apples":[0,95,105,75],"Grapes":[110,45,95,0]})

In [ ]:
df=pd.DataFrame({"Apples":[0,89,67,56],"Grapes":[23,45,65,43x]})

In [156]:
df

   Apples  Grapes
0       0     110
1      95      45
2     105      95
3      75       0

In [158]:
df.replace({0:69,95:125}) #<- it will change the values of data from the rows also it will not change permanently
# It changes from all 95 to 125 and all 0 to 69

   Apples  Grapes
0      69     110
1     125      45
2     105     125
3      75      69

In [161]:
df=pd.DataFrame(np.random.randn(5,3),
               index=["A","C","E","B","D"],
               columns=["Col1","Col2","Col3"])

In [162]:
df

       Col1      Col2      Col3
A  0.944880 -0.408818 -0.424686
C  1.514090  0.003734 -0.831930
E -0.437477  1.017236 -0.333719
B -0.517032 -0.416187 -0.501874
D -0.642225  1.477938  1.067335

In [163]:
df.replace({1.514090: 25, 0.944880 : 80 })
#Here , this is not changed bcoz there for replace you have to enter the same data of column ehcih you want to change
# But at here,we have taken the value from float function and its values is more larger, but here in data table , it shoes only 6 number after point. so we don't know the exactly data. That's why it won't be changed

       Col1      Col2      Col3
A  0.944880 -0.408818 -0.424686
C  1.514090  0.003734 -0.831930
E -0.437477  1.017236 -0.333719
B -0.517032 -0.416187 -0.501874
D -0.642225  1.477938  1.067335

In [ ]:
# for changing that float random values, you have to first round off it, and then you have to print it

In [164]:
df.round(4)  #<- it will round off the values for 4 numbers

     Col1    Col2    Col3
A  0.9449 -0.4088 -0.4247
C  1.5141  0.0037 -0.8319
E -0.4375  1.0172 -0.3337
B -0.5170 -0.4162 -0.5019
D -0.6422  1.4779  1.0673

In [169]:
df=pd.DataFrame({"Apples":[50,95,105,75],"Grapes":[110,45,99,0]})

In [170]:
df

   Apples  Grapes
0      50     110
1      95      45
2     105      99
3      75       0

In [ ]:
# suppose that you have to change the value 105 to 90 without using replace function

In [171]:
df["Apples"].loc[2] = 90   #or df.Apples.loc[2] = 90

In [172]:
df.Apples.loc[3]=50

In [173]:
df

   Apples  Grapes
0      50     110
1      95      45
2      90      99
3      50       0

# Handle Duplicates Values

In [ ]:
check the duplicate values - duplicated()

In [174]:
df

   Apples  Grapes
0      50     110
1      95      45
2      90      99
3      50       0

In [133]:
df.duplicated()  #here there is no same values in same row, so every line will be false

0    False
1    False
2    False
3    False
dtype: bool

In [135]:
df

   Apples  Grapes
0      50     110
1      95      45
2      90      99
3      50       0

In [176]:
df.duplicated(subset=["Apples"])

0    False
1    False
2    False
3     True
dtype: bool

In [134]:
df.duplicated(subset=["Apples"])   #<- It will check every values of columns and if there will be same value, then it will give true
# here, in Apples the first and last word has same values, so it will give true in last

0    False
1    False
2    False
3     True
dtype: bool

# Remove duplicate value - drop_duplicates()

In [177]:
df

   Apples  Grapes
0      50     110
1      95      45
2      90      99
3      50       0

In [178]:
df.drop_duplicates(subset=["Apples"])

   Apples  Grapes
0      50     110
1      95      45
2      90      99

In [179]:
df

   Apples  Grapes
0      50     110
1      95      45
2      90      99
3      50       0

In [ ]:
Import /Export a dataset

In [140]:
data="Link of the data or csv file"
df=pd.read_csv(data)

In [ ]:
df.to_csv("name_of_the_new_file with location")

In [185]:
df.to_csv("C:/Users/Hello/Desktop/new.csv")

In [146]:
df.info()  #<- it gives all the information about the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Apples  4 non-null      int64
 1   Grapes  4 non-null      int64
dtypes: int64(2)
memory usage: 192.0 bytes

In [147]:
type(df)

pandas.core.frame.DataFrame

In [35]:
%autosave 120

Autosaving every 120 seconds